var formList=[
  {
    "formsCode": "31201,00114;20011,31104;31201,00114;20011,31104",
    "formsId": "1-1",
    "formsName": "五律·仄起首句不入韵"
  },
  {
    "formsCode": "31104,00114;20011,31104;31201,00114;20011,31104",
    "formsId": "1-2",
    "formsName": "五律·仄起首句入韵"
  },
  {
    "formsCode": "20011,31104;31201,00114;20011,31104;31001,00114",
    "formsId": "1-3",
    "formsName": "五律·平起首句不入韵"
  },
  {
    "formsCode": "00114,31104;31201,00114;20011,31104;31001,00114",
    "formsId": "1-4",
    "formsName": "五律·平起首句入韵"
  },
  {
    "formsCode": "31201,00114;20011,31104",
    "formsId": "2-1",
    "formsName": "五绝·仄起首句不入韵"
  },
  {
    "formsCode": "31124,00114;20011,31104",
    "formsId": "2-2",
    "formsName": "五绝·仄起首句入韵"
  },
  {
    "formsCode": "20011,31104;31201,00114",
    "formsId": "2-3",
    "formsName": "五绝·平起首句不入韵"
  },
  {
    "formsCode": "00114,31104;31201,00114",
    "formsId": "2-4",
    "formsName": "五绝·平起首句入韵"
  },
  {
    "formsCode": "3120011,2031104;2031201,3100114;3120011,2031104;2031201,3100114",
    "formsId": "3-1",
    "formsName": "七律·仄起首句不入韵"
  },
  {
    "formsCode": "3100114,2031104;2031201,3100114;3120011,2031104;2031201,3100114",
    "formsId": "3-2",
    "formsName": "七律·仄起首句入韵"
  },
  {
    "formsCode": "2031201,3100114;3120011,2031104;2031201,3100114;3120211,2031104",
    "formsId": "3-3",
    "formsName": "七律·平起首句不入韵"
  },
  {
    "formsCode": "2031104,3100114;3120011,2031104;2031201,3100114;3120211,2031104",
    "formsId": "3-4",
    "formsName": "七律·平起首句入韵"
  },
  {
    "formsCode": "3120011,2031104;2031201,3100114",
    "formsId": "4-1",
    "formsName": "七绝·仄起首句不入韵"
  },
  {
    "formsCode": "3100114,2031104;2031201,3100114",
    "formsId": "4-2",
    "formsName": "七绝·仄起首句入韵"
  },
  {
    "formsCode": "2031201,3100114;3120011,2031104",
    "formsId": "4-3",
    "formsName": "七绝·平起首句不入韵"
  },
  {
    "formsCode": "2031104,3100114;3120011,2031104",
    "formsId": "4-4",
    "formsName": "七绝·平起首句入韵"
  }
]
